Tekla Open API Reference for Tekla Structures 2025
AnalysisModelModalAnalysisProperties Class
 The AnalysisModelModalAnalysisProperties class contains information related to analysis model modal analysis properties.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Analysis.AnalysisModelModalAnalysisProperties
 Namespace: Tekla.Structures.Analysis
 Assembly: Tekla.Structures.Analysis (in Tekla.Structures.Analysis.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public sealed class AnalysisModelModalAnalysisProperties
Public NotInheritable Class AnalysisModelModalAnalysisProperties
The AnalysisModelModalAnalysisProperties type exposes the following members.
Constructors
Name | Description
AnalysisModelModalAnalysisProperties
Initializes a new instance of the AnalysisModelModalAnalysisProperties class
Top
Properties
Name | Description
ModalAnalysisIncludeSelfWeightMass
 Indicates whether selfweight mass is included in the modal analysis.
ModalAnalysisMassLoadGroupDirections
 The mass load group directions of the modal analysis.
ModalAnalysisMassLoadGroupFactors
 The mass load group factors of the modal analysis.
ModalAnalysisMassLoadGroupIds
 The mass load group indentifier of the modal analysis.
ModalAnalysisMaxFrequency
 The modal analysis maximum frequence.
ModalAnalysisModeCount
 The modal analysis mode count.
ModalAnalysisModel
 Indicates whether a modal analysis model is used.
Top
See Also
Reference
Tekla.Structures.Analysis Namespace